In [2]:
# DataFrame是一个表格型的数据结构
# 它含有一组有序的列，每列可以是不同的值类型（数值、 字符串、 布尔值等）
# DataFrame既有行索引也有列索引， 它可以被看做由Series组成的字典（共用同一个索引）
# DataFrame中的数据是以一个或多个二维块存放的（而不是列表、 字典或别的一维数据结构）

# 笔记： 虽然DataFrame是以二维结构保存数据的， 
# 但仍然可以轻松地将其表示为更高维度的数据（层次化索引的表格型结构
#  这是pandas中许多高级数据处理功能的关键要素

import pandas as pd
# 创建 DtaFrame 的办法有很多
# 最常用的一种是直接传入一个由等长列表或 NumPy 数组组成的字典
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

# 结果 DataFrame 会自动加上索引（跟Series一样），且全部列会被有序排列
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [3]:
# 对于特别大的DataFrame， head方法会选取前五行：
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [5]:
# 如果指定了列序列， 则DataFrame的列就会按照指定顺序进行排列：
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [6]:
# 如果传入的列在数据中找不到， 就会在结果中产生缺失值：
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                            index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [7]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [8]:
# 通过类似字典标记的方式或属性的方式， 可以将DataFrame的列获取为一个Series
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [9]:
 frame2.year
# 注意， 返回的Series拥有原DataFrame相同的索引， 且其name属性也已经被相应地设置好了

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [10]:
# 行也可以通过位置或名称的方式进行获取， 比如用loc属性
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [11]:
# 列可以通过赋值的方式进行修改
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [13]:
# 将列表或数组赋值给某个列时， 其长度必须跟DataFrame的长度相匹配。
# 如果赋值的是一个 Series， 就会精确匹配DataFrame的索引， 所有的空位都将被填上缺失值
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [17]:
# 不存在的列赋值会创建出一个新列
# 关键字del用于删除列
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [18]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [19]:
# 注意： 通过索引方式返回的列只是相应数据的视图而已， 并不是副本。 
# 因此， 对返回的 Series 所做的任何就地修改全都会反映到源DataFrame上
# 通过Series的copy方法即可指定复制列

# 常见的数据形式是嵌套字典
# 嵌套字典传给DataFrame， pandas就会被解释为： 外层字典的键作为列， 内层键则作为行索引：
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [20]:
# 可以使用类似NumPy数组的方法， 对DataFrame进行转置（交换行和列）
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [21]:
# 内层字典的键会被合并、 排序以形成最终的索引。 
# 如果明确指定了索引， 则不会这样
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [22]:
# 由Series组成的字典差不多也是一样的用法
pdata = {'Ohio': frame3['Ohio'][:-1],
           'Nevada': frame3['Nevada'][:2]}

pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [25]:
# DataFrame构造函数所能接受的各种数据
# 二维 ndarray ，字典（Series 数组 列表 元组 字典），
# 列表（字典 Series 列表 元组），DataFrame，numpy的MaskedArray

# 设置了DataFrame的index和columns的name属性， 则这些信息也会被显示出来：
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [26]:
# 跟Series一样， values属性也会以二维ndarray的形式返回DataFrame中的数据
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [27]:
# 如果DataFrame各列的数据类型不同， 则值数组的dtype就会选用能兼容所有列的数据类型
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)